{
  "book": "Book 60",
  "book_canonical": "1_peter",
  "book_number": 60,
  "chapter": 2,
  "verses": {
    "1": {
      "text": "Nuko mwiyambure igomwa ryose n'uburiganya bwose, n'uburyarya n'ishyari no gusebanya kose,",
      "start": 0,
      "end": 7.369
    },
    "2": {
      "text": "mumere nk'impinja zivutse vuba, mwifuze amata y'umwuka adafunguye, kugira ngo abakuze abageze ku gakiza,",
      "start": 7.369,
      "end": 10.552
    },
    "3": {
      "text": "niba mwarasogongeye mukamenya yuko Umwami wacu agira neza.",
      "start": 10.552,
      "end": 18.99
    },
    "4": {
      "text": "Nimumwegere ni we Buye rizima ryanzwe n'abantu, ariko ku Mana ryaratoranijwe riba iry'igiciro cyinshi,",
      "start": 18.99,
      "end": 29.16
    },
    "5": {
      "text": "namwe mwubakwe nk'amabuye mazima kugira ngo mube inzu y'umwuka, n'ubwoko bw'abatambyi bwera bwo gutamba ibitambo by'umwuka bishimwa n'Imana ku bwa Yesu Kristo.",
      "start": 29.16,
      "end": 39.68
    },
    "6": {
      "text": "Kuko mu byanditswe harimo aya magambo ngo“Dore ndashyira muri Siyoni ibuye rikomeza impfuruka,Ryatoranijwe kandi ry'igiciro cyinshi,Kandi uryizera ntazakorwa n'isoni.”",
      "start": 39.68,
      "end": 49.68
    },
    "7": {
      "text": "Nuko rero, mwebwe ubwo mwizeye, muzi ko ari iby'igiciro cyinshi koko, naho ku banga kwizera,“Ibuye abubatsi banze ni ryo ryahindutse irikomeza impfuruka,",
      "start": 49.68,
      "end": 59.14
    },
    "8": {
      "text": "Ni ibuye risitaza n'urutare rugusha.”Basitara ku ijambo ry'Imana ntibaryumvire kandi ari bo ryagenewe.",
      "start": 59.14,
      "end": 67
    },
    "9": {
      "text": "Ariko mwebweho muri ubwoko bwatoranijwe, abatambyi b'ubwami, ishyanga ryera n'abantu Imana yaronse, kugira ngo mwamamaze ishimwe ry'Iyabahamagaye, ikabakura mu mwijima ikabageza mu mucyo wayo w'itangaza. 2.14; Yes 9.1",
      "start": 67,
      "end": 78.586
    },
    "10": {
      "text": "Kera ntimwari ubwoko ariko none muri ubwoko bw'Imana. Kera ntimurakababarirwa ariko none mwarababariwe.",
      "start": 78.586,
      "end": 84.476
    },
    "11": {
      "text": "Bakundwa, ndabahugura ubwo muri abasuhuke n'abimukira, kugira ngo mwirinde irari ry'umubiri ry'uburyo bwinshi rirwanya ubugingo.",
      "start": 84.476,
      "end": 97.746
    },
    "12": {
      "text": "Mugire ingeso nziza hagati y'abapagani, kugira ngo, nubwo babasebya nk'abakora nabi, nibabona imirimo yanyu myiza, izabatere guhimbaza Imana ku munsi wo kugendererwamo.",
      "start": 97.746,
      "end": 108.619
    },
    "13": {
      "text": "Mugandukire ubutware bwose bw'abantu ku bw'Umwami wacu, naho yaba umwami kuko ari we usumba bose,",
      "start": 108.619,
      "end": 117.709
    },
    "14": {
      "text": "cyangwa abatware kuko ari bo batumwe na we guhana inkozi z'ibibi, no gushima abakora neza.",
      "start": 117.709,
      "end": 127.181
    },
    "15": {
      "text": "Kuko ibyo Imana ishaka ari uko mujibisha abantu b'abapfapfa batagira icyo bamenya, gukora neza kwanyu",
      "start": 127.181,
      "end": 137.161
    },
    "16": {
      "text": "mumeze nk'ab'umudendezo koko, ariko uwo mudendezo mutawutwikiriza ibibi ahubwo mugenze nk'imbata z'Imana.",
      "start": 137.161,
      "end": 144.899
    },
    "17": {
      "text": "Mwubahe abantu bose, mukunde bene Data, mwubahe Imana, mwubahe umwami.",
      "start": 144.899,
      "end": 153.415
    },
    "18": {
      "text": "Bagaragu b'imbata, mugandukire ba shobuja mububashye rwose, atari abeza n'abagira ineza gusa ahubwo n'ibigoryi,",
      "start": 153.415,
      "end": 162.569
    },
    "19": {
      "text": "kuko igishimwa ari uko umuntu yakwihanganira imibabaro bamuhoye ubusa, azize umutima utunganiye Imana.",
      "start": 162.569,
      "end": 170.989
    },
    "20": {
      "text": "Ariko se niba mwihanganira gukubitwa ibipfunsi babahora icyaha, muzashimwa iki? Icyakora niba mukora neza, akaba ari byo mubabarizwa mukabyihanganira, ibyo ni byo Imana ishima",
      "start": 170.989,
      "end": 173.869
    },
    "21": {
      "text": "kandi ibyo ni byo mwahamagariwe, kuko na Kristo yabababarijwe akabasigira icyitegererezo, kugira ngo mugere ikirenge mu cye.",
      "start": 173.869,
      "end": 197.879
    },
    "22": {
      "text": "Nta cyaha yakoze, nta n'uburiganya bwabonetse mu kanwa ke:",
      "start": 197.879,
      "end": 198.299
    },
    "23": {
      "text": "yaratutswe ntiyabasubiza, yarababajwe ntiyabakangisha, ahubwo aritanga yiha Idaca urwa kibera.",
      "start": 198.299,
      "end": 204.979
    },
    "24": {
      "text": "Ubwe yikoreye ibyaha byacu mu mubiri we abibambanwa ku giti, kugira ngo dupfe ku byaha duhereko tubeho ku gukiranuka. Imibyimba ye ni yo yabakijije.",
      "start": 204.979,
      "end": 219.059
    },
    "25": {
      "text": "Kuko mwari nk'intama zizimiye, ariko none mukaba mwaragarukiye Umwungeri w'ubugingo bwanyu ari we Murinzi wabwo.",
      "start": 219.059,
      "end": 234.902
    }
  }
}
