{
  "book": "Book 60",
  "book_canonical": "1_peter",
  "book_number": 60,
  "chapter": 1,
  "verses": {
    "1": {
      "text": "Petero intumwa ya Yesu Kristo, ndabandikiye mwebwe abimukira b'intore bo mu batataniye i Ponto n'i Galatiya, n'i Kapadokiya no muri Asiya n'i Bituniya,",
      "start": 0,
      "end": 11.239
    },
    "2": {
      "text": "mwatoranijwe nk'uko Imana Data wa twese yabamenye kera mubiheshejwe no kwezwa n'Umwuka, kugira ngo mwumvire Imana muminjagirwe amaraso ya Yesu Kristo.Ubuntu n'amahoro bigwire muri mwe.",
      "start": 11.239,
      "end": 23.396
    },
    "3": {
      "text": "Imana y'Umwami wacu Yesu Kristo, ari na yo Se, ishimwe kuko yatubyaye ubwa kabiri nk'uko imbabazi zayo nyinshi ziri, kugira ngo tugire ibyiringiro bizima tubiheshejwe no kuzuka kwa Yesu Kristo,",
      "start": 23.396,
      "end": 30.768
    },
    "4": {
      "text": "tuzabone umurage utabasha kubora cyangwa kwandura cyangwa kugajuka, ari wo namwe mwabikiwe mu ijuru,",
      "start": 30.768,
      "end": 38.079
    },
    "5": {
      "text": "mwebwe abarindwa n'imbaraga z'Imana ku bwo kwizera, murindirwa agakiza kiteguwe kuzahishurwa mu gihe cy'imperuka.",
      "start": 38.079,
      "end": 44.276
    },
    "6": {
      "text": "Ni cyo gituma mwishima, nubwo ahari mukwiriye kumara igihe gito mubabazwa n'ibibagerageza byinshi,",
      "start": 44.276,
      "end": 52.911
    },
    "7": {
      "text": "kugira ngo kwizera kwanyu kugaragare ko kurusha izahabu igiciro cyinshi (kandi izahabu nubwo ishira igeragereshwa umuriro), kandi kugira ngo kwizera kwanyu kugaragare ko ari uk'ukuri, amaherezo kuzabahesha ishimwe n'ubwiza n'icyubahiro ubwo Yesu Kristo azahishurwa.",
      "start": 52.911,
      "end": 62.814
    },
    "8": {
      "text": "Uwo mumukunda mutaramubona, kandi nubwo none mutamureba muramwizera, ni cyo gituma mwishima ibyishimo byiza bitavugwa,",
      "start": 62.814,
      "end": 71.534
    },
    "9": {
      "text": "kuko muhabwa agakiza k'ubugingo bwanyu ari ko ngororano yo kwizera kwanyu.",
      "start": 71.534,
      "end": 76.724
    },
    "10": {
      "text": "Abahanuzi bahanuye iby'ako gakiza barondora n'iby'ubuntu mwari mugiye kuzahabwa babishimikiriye,",
      "start": 76.724,
      "end": 83.148
    },
    "11": {
      "text": "barondora igihe icyo ari cyo n'ibimenyetso byacyo, byerekanwaga n'Umwuka wa Kristo wari muri bo agahamya imibabaro ya Kristo itari yaba, n'ubwiza bw'uburyo bwinshi bwari bugiye kuyiheruka.",
      "start": 83.148,
      "end": 95.284
    },
    "12": {
      "text": "Kandi bahishurirwa yuko batabyiyerekewe ahubwo ko ari mwe babyerekewe. Ibyo none mumaze kubibwirwa n'ababwirije ubutumwa bwiza, babwirijwe n'Umwuka Wera woherejwe ava mu ijuru, kandi ibyo abamarayika babigirira amatsiko bashaka kubirunguruka.",
      "start": 95.284,
      "end": 112.047
    },
    "13": {
      "text": "Nuko mukenyere mu mitima yanyu, mwirinde ibisindisha, mwiringire rwose impano y'ubuntu muzazanirwa, ubwo Yesu Kristo azahishurwa.",
      "start": 112.047,
      "end": 120.723
    },
    "14": {
      "text": "Mube nk'abana bumvira, ntimwishushanye n'irari mwagiraga kera mukiri injiji.",
      "start": 120.723,
      "end": 125.626
    },
    "15": {
      "text": "Ahubwo nk'uko uwabahamagaye ari uwera, abe ari ko namwe muba abera mu ngeso zanyu zose.",
      "start": 125.626,
      "end": 130.029
    },
    "16": {
      "text": "Kuko byanditswe ngo “Muzabe abera kuko ndi uwera.”",
      "start": 130.029,
      "end": 133.407
    },
    "17": {
      "text": "Kandi ubwo uwo mwambaza mumwita So, ari ucira umuntu wese urubanza rukwiriye ibyo yakoze ntarobanure ku butoni, mumare iminsi y'ubusuhuke bwanyu mutinya.",
      "start": 133.407,
      "end": 142.354
    },
    "18": {
      "text": "Kuko muzi yuko ibyo mwacungujwe ngo muve mu ngeso zanyu zitagira umumaro mwatojwe na ba sekuruza banyu, atari ibyangirika nk'ifeza cyangwa izahabu,",
      "start": 142.354,
      "end": 152.182
    },
    "19": {
      "text": "ahubwo mwacungujwe amaraso y'igiciro cyinshi, nk'ay'umwana w'intama utagira inenge cyangwa ibara, ari yo ya Kristo",
      "start": 152.182,
      "end": 159.283
    },
    "20": {
      "text": "wamenywe n'Imana kera isi itararemwa, ariko akerekanwa ku mperuka y'ibihe ku bwanyu,",
      "start": 159.283,
      "end": 165.191
    },
    "21": {
      "text": "abo yahaye kwizera Imana yamuzuye ikamuha icyubahiro, kugira ngo kwizera kwanyu n'ibyiringiro byanyu bibe ku Mana.",
      "start": 165.191,
      "end": 172.307
    },
    "22": {
      "text": "Nuko rero ubwo mwiyejesheje imitima kumvira ukuri kugira ngo mubone uko mukunda bene Data mutaryarya, mukundane cyane mu mitima",
      "start": 172.307,
      "end": 181.305
    },
    "23": {
      "text": "kuko mwabyawe ubwa kabiri, mutabyawe n'imbuto ibora ahubwo mwabyawe n'imbuto itabora, mubiheshejwe n'ijambo ry'Imana rizima rihoraho.",
      "start": 181.305,
      "end": 190.836
    },
    "24": {
      "text": "Kuko,“Abafite imibiri bose bahwanye n'ibyatsi,Ubwiza bwabo bwose bumeze nk'uburabyo bw'ibyatsi.Ibyatsi biruma uburabyo bwabyo bugahunguka,",
      "start": 190.836,
      "end": 199.919
    },
    "25": {
      "text": "Ariko ijambo ry'Uwiteka ryo rihoraho iteka.”Kandi iri ni ryo jambo ry'ubutumwa bwiza mwabwirijwe.",
      "start": 199.919,
      "end": 219.701
    }
  }
}
